package org.example.HW_08_080224;

// 1 уровень сложности: 1)
//Найти сумму всех элементов ArrayList.
//Перебрать ArrayList и вывести все элементы на экран.
//Создать ArrayList с объектами вашего собственного класса и вывести их на экран.
//
//        2)
//Перебрать ArrayList и найти наименьший элемент.
//Перебрать ArrayList и найти количество элементов, начинающихся с определенной буквы.
//Создать ArrayList с объектами вашего собственного класса и удалить все элементы, удовлетворяющие определенному условию.
//
//
//3*)
//Перебрать ArrayList и удалить все четные числа.
//Перебрать ArrayList и объединить все элементы в одну строку.
//Создать ArrayList с объектами вашего собственного класса и вывести только те, которые удовлетворяют определенному условию.
//
//
//        4)
//Перебрать ArrayList и найти сумму квадратов всех элементов.
//Перебрать ArrayList и найти самую короткую строку.
//Перебрать ArrayList и заменить все гласные буквы в каждой строке на символ ''.
//
//
//        5*)
//Перебрать ArrayList и найти второй по величине элемент.
//Перебрать ArrayList и вывести все элементы в обратном порядке.
//Перебрать ArrayList и вывести все строки, содержащие только буквы.
//Перебрать ArrayList и найти самую длинную строку, не содержащую пробелов.
//Создать ArrayList с объектами вашего собственного класса и отфильтровать только уникальные элементы.
//
//
//        6*)
//Перебрать ArrayList и найти наибольшую возрастающую последовательность элементов.
//Перебрать ArrayList и удалить все дубликаты элементов.
//Перебрать ArrayList и создать новый список, содержащий только уникальные строки.
//Перебрать ArrayList и объединить все строки в одну с использованием разделителя.
public class task1 {
    public static void main(String[] args) {

    }
}
